Repository: rmed/zoe_docs
Catalog: locale/*/LC_MESSAGES/agents/messages.po
Languages: es

source: Messages
es: Mensajes

source: Message structure
es: Estructura de mensajes

source: Agents interchange messages through the server *message bus*. These message strings have a *key-value* structure of the form::
es: Los agentes intercambian mensajes mediante el *bus de mensajes* del servidor. Estos mensajes tienen una estructura *clave-valor* de la forma::

source: For instance, the ``broadcast`` agent can send a message to a specific user. The message string to do so would look like this::
es: Por ejemplo, el agente ``broadcast`` puede enviar un mensaje a un usuario específico. La cadena para hacerlo sería algo parecido a esto::

source: Now, analyzing the message:
es: Analizando el mensaje:

source: ``dst``: Agent that is supposed to receive this message.
es: ``dst``: Agente al que va destinado el mensaje.

source: ``tag``: Action to perform. There can be several ``tag`` entries in the message.
es: ``tag``: Acción a realizar. Puede haber varios ``tag`` en el mensaje.

source: ``msg``: Message to send to the user.
es: ``msg``: Mensaje que mandar al usuario.

source: ``to``: User to send the message to. This name is checked against the user list to see what John's address and preferred contact method are.
es: ``to``: Usuario al que mandar el mensaje. El nombre se comprueba con la lista de usuarios para ver cuál es la dirección de John y su método de contacto preferido.

source: The message string will vary depending on each agent, but most of them will have common parts such as ``dst`` and ``tag``.
es: La cadena puede variar dependiendo de cada agente, pero la mayoría tendrán partes comunes como ``dst`` y ``tag``.

source: Sending messages to the server
es: Enviando mensajes al servidor

source: Apart from the agents interchanging messages, it is also possible to manually send a message to the server in order to have an agent execute some action. Taking the previous ``broadcast`` agent example, the message could be sent like so::
es: Aparte del intercambio de mensajes de los agentes, también se puede enviar un mensaje al servidor manualmente para que un agente ejecute alguna acción. Tomando el anterior ejemplo del agente ``broadcast``, el mensaje se podría enviar como::

source: Now, the ``logs/broadcast.log`` file would have an entry for the received message and the action executed (or any errors while doing so).
es: Ahora, el archivo ``logs/broadcast.log`` tendría una entrada con el mensaje recibido y la acción realizada (o cualquier error mientras se llevaba a cabo).
