Repository: rmed/zoe_docs
Catalog: locale/*/LC_MESSAGES/getting_started/configuration.po
Languages: es

source: Configuration
es: Configuración

source: *Zoe*'s configuration files are found in the ``etc/`` directory. These are the base files you will find there::
es: Los archivos de configuración de *Zoe* se encuentran en el directorio ``etc/``. Estos son los archivos base que se encuentran en el directorio::

source: Environment
es: Entorno

source: The ``environment.sh`` script sets several variables such as the *server host*, *twitter credentials*, *jabber information*, etc. It has the following content:
es: El script ``environment.sh`` establece variables tales como el *host del servidor*, *credenciales de twitter*, *información de jabber*, etc. Tiene el siguiente contenido:

source: **You should never give Zoe your own twitter/jabber credentials. Create a new account if you intend to use them.**
es: **Nunca des a Zoe tus propias credenciales de twitter/jabber. Crea una nueva cuenta si pretendes usarlos.**

source: By default, the Jabber and GMail accounts use the same credentials due to the Google Talk (Hangouts) service using Jabber. You can use other Jabber service and email provider if you wish so.
es: Por defecto, las cuentas de Jabber y GMail usan las mismas credenciales debido a que el servicio de Google Talk (Hangouts) utiliza Jabber. Puedes utilizar otros servicios de Jabber y correo electrónico si lo deseas.

source: Users
es: Usuarios

source: The ``zoe-users.conf`` file follows this structure:
es: El archivo ``zoe-users.conf`` sigue esta estructura:

source: Each user is identified using the ``[subject USER]`` tag and has the following attributes:
es: Cada usuario está identificado por la etiqueta ``[subject USUARIO]`` y tiene los siguientes atributos:

source: ``name``: The user's name (e.g. Zoe).
es: ``name``: El nombre del usuario (ej. Zoe).

source: ``twitter``: The user's twitter username (e.g. gul_zoe).
es: ``twitter``: El nombre de usuario de twitter (ej. gul_zoe).

source: ``preferred``: The preferred way for Zoe to communicate with the user. Available values are ``twitter``, ``jabber``, ``mail``.
es: ``preferred``: La forma de comunicación con Zoe preferida por el usuario. Los posibles valores son ``twitter``, ``jabber``, ``mail``.

source: ``jabber``: The user's jabber address. Note that if you are using *Google Hangouts*, the jabber addresses have the format ``abcdefghijklmnopqrstuwxyz1@public.talk.google.com``. If you don't know this address, you may try speaking with *Zoe* through Jabber and getting the address from the logs.
es: ``jabber``: La dirección de jabber del usuario. Si utilizas *Google Hangouts*, las direcciones de jabber siguen un formato ``abcdefghijklmnopqrstuwxyz1@public.talk.google.com``. Si no sabes cuál es la dirección, puedes intentar hablar con *Zoe* por Jabber y obtener la dirección de los registros.

source: ``mail``: The user's mail address.
es: ``mail``: La dirección de correo del usuario.

source: ``alias``: The user's alias.
es: ``alias``: El alias del usuario.

source: Some agents may use *groups* to send mails to several users at the same time or check for user permissions. Define a new group by using the scructure ``[group GROUPNAME]`` and adding its users to the ``members`` attribute.
es: Algunos agentes pueden utilizar *grupos* para envíar correos a varios usuarios al mismo tiempo o comprobar permisos. Se puede definir un nuevo grupo usando la estructura ``[group NOMBRE DE GRUPO]`` y añadiendo a sus usuarios en el atributo``members``.

source: Agents
es: Agentes

source: Some agents, such as the Twitter agent, may include additional configuration files. In this case, ``twitter.conf`` contains the credentials required by the Twitter agent. These credentials can be obtained from the Twitter profile.
es: Algunos agentes, como el agente de Twitter, pueden incluir archivos de configuración adicionales. En este caso, ``twitter.conf`` contiene las credenciales requeridas por el agente de Twitter. Estas credenciales se pueden obtener desde el perfil de Twitter.

source: The ``zam`` directory is part of the Zoe Agent Manager, in charge of installing and managing agents. For more information, check the :doc:`Agent installation section </agents/installing>`.
es: El directorio ``zam`` es parte del Gestor de Agentes de Zoe, encargado de instalar y gestionar agentes. Para más información, visita la :doc:`sección de instalación de Agentes </agents/installing>`.

source: The ``zoe.conf`` file contains a list of agents with their corresponding ports and a list of agents related to a specific topic. For more information check the :doc:`Agents section </agents/index>` of this documentation.
es: El archivo ``zoe.conf`` contiene una lista de agentes con sus correspondientes puertos y una lista de agentes relacionados con un tema específico. Para más información, visita la :doc:`sección de Agentes </agents/index>` de esta documentación
