Repository: rmed/zoe_docs
Catalog: locale/*/LC_MESSAGES/getting_started/dir_structure.po
Languages: es

source: Directory structure
es: Estructura de directorios

source: The `Zoe startup kit <https://github.com/voiser/zoe-startup-kit>`_ has the following directory structure::
es: El `kit de iniciación de Zoe <https://github.com/voiser/zoe-startup-kit>`_ tiene la siguiente estructura::

source: ``agents/``: Installed Zoe agents
es: ``agents/``: Agentes instalados

source: ``cmdproc/``: Administrator commands in natural language
es: ``cmdproc/``: Comandos de administrador en lenguaje natural

source: ``etc/``: Configuration files
es: ``etc/``: Archivos de configuración

source: ``lib/``: Libraries and agent dependencies by language
es: ``lib/``: Librerías y dependencias de agentes por lenguaje

source: ``logs/``: Agent log files
es: ``logs/``: Archivos de registro de los agentes

source: ``mailproc/``: Actions to execute when receiving mails
es: ``mailproc/``: Acciones a ejecutar al recibir emails

source: ``server/``: Zoe server binaries
es: ``server/``: Binarios del servidor de Zoe

source: ``var/``: Databases and temp files generated by agents
es: ``var/``: Bases de datos y archivos temporales generados por los agentes

source: ``zoe.sh``: Zoe script
es: ``zoe.sh``: Script de Zoe
